-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jul 28, 2025 at 07:01 AM
-- Server version: 10.6.11-MariaDB
-- PHP Version: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `kpswacth_reg`
--

-- --------------------------------------------------------

--
-- Table structure for table `subjects`
--

CREATE TABLE `subjects` (
  `subject_id` int(11) NOT NULL,
  `subject_code` varchar(20) NOT NULL,
  `subject_name` varchar(100) NOT NULL,
  `credits` decimal(3,1) NOT NULL,
  `description` text DEFAULT NULL,
  `grade_level` enum('ม.1','ม.2','ม.3','ม.4','ม.5','ม.6') NOT NULL,
  `area_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `subjects`
--

INSERT INTO `subjects` (`subject_id`, `subject_code`, `subject_name`, `credits`, `description`, `grade_level`, `area_id`, `created_at`, `updated_at`) VALUES
(1, 'ท21101', 'ภาษาไทย 1', '3.0', 'วิชาภาษาไทยพื้นฐาน', 'ม.1', 1, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(2, 'ค21101', 'คณิตศาสตร์ 1', '3.0', 'วิชาคณิตศาสตร์พื้นฐาน', 'ม.1', 2, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(3, 'ว21101', 'วิทยาศาสตร์ 1', '3.0', 'วิชาวิทยาศาสตร์พื้นฐาน', 'ม.1', 3, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(4, 'ส21101', 'สังคมศึกษา 1', '3.0', 'วิชาสังคมศึกษา 1', 'ม.1', 4, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(5, 'ส21102', 'สังคมศึกษา 2', '3.0', 'วิชาสังคมศึกษา 2', 'ม.1', 4, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(6, 'พ21101', 'พลศึกษา 1', '2.0', 'วิชาพลศึกษาเบื้องต้น', 'ม.1', 5, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(7, 'พ21103', 'พลศึกษา 3', '2.0', 'วิชาพลศึกษาระดับสูง', 'ม.1', 5, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(8, 'ศ21101', 'ศิลปะ 1', '2.0', 'วิชาศิลปะพื้นฐาน', 'ม.1', 6, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(9, 'ว21106', 'เทคโนโลยีและวิทยาการคำนวณ 1', '2.0', 'วิชาเทคโนโลยีสารสนเทศและวิทยาการคำนวณ 1', 'ม.1', 7, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(10, 'อ21101', 'ภาษาอังกฤษ 1', '3.0', 'วิชาภาษาอังกฤษพื้นฐาน', 'ม.1', 8, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(11, 'ง21261', 'อาหารว่างและเครื่องดื่ม 1', '2.0', 'วิชาอาหารว่างและเครื่องดื่ม', 'ม.1', 7, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(12, 'ง20265', 'งานปลูกไม้ดอกไม้ประดับ', '2.0', 'วิชางานปลูกไม้ดอกไม้ประดับ', 'ม.1', 7, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(13, 'ง21265', 'วัสดุงานช่าง', '2.0', 'วิชาวัสดุงานช่าง', 'ม.1', 7, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(14, 'ก20201', 'ภาษาเกาหลี 1', '3.0', 'วิชาภาษาเกาหลีเบื้องต้น', 'ม.1', 8, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(15, 'จ20219', 'ภาษาจีนพื้นฐาน 1', '3.0', 'วิชาภาษาจีนพื้นฐาน', 'ม.1', 8, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(16, 'ท20207', 'พัฒนาทักษะการอ่านและการเขียน 1', '2.0', 'วิชาพัฒนาทักษะการอ่านและการเขียน', 'ม.1', 1, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(17, 'ค20213', 'คณิตศาสตร์เสริมศักยภาพ 1', '3.0', 'วิชาคณิตศาสตร์เสริมศักยภาพ', 'ม.1', 2, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(18, 'ว20207', 'เสริมทักษะกระบวนการวิทยาศาสตร์', '3.0', 'วิชาเสริมทักษะกระบวนการวิทยาศาสตร์', 'ม.1', 3, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(19, 'ว20239', 'การสร้างและการจัดการเอกสารดิจิทัล', '2.0', 'วิชาการสร้างและการจัดการเอกสารดิจิทัล', 'ม.1', 3, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(20, 'ง21270', 'การออกแบบ 1', '2.0', 'วิชาการออกแบบ 1', 'ม.1', 9, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(21, 'อ20213', 'ภาษาอังกฤษฟัง-พูด 1', '3.0', 'วิชาภาษาอังกฤษฟัง-พูด', 'ม.1', 8, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(22, 'อ20220', 'ภาษาอังกฤษอ่าน-เขียน 1', '3.0', 'วิชาภาษาอังกฤษอ่าน-เขียน', 'ม.1', 8, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(23, 'ว21224', 'คอมพิวเตอร์พื้นฐาน', '2.0', 'วิชาคอมพิวเตอร์พื้นฐาน', 'ม.1', 7, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(24, 'ค20219', 'คณิตศาสตร์ส่งเสริมความเป็นเลิศ 1', '3.0', 'วิชาคณิตศาสตร์ส่งเสริมความเป็นเลิศ', 'ม.1', 2, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(25, 'ว20231', 'ชีววิทยาพื้นฐานและปฏิบัติการ 1', '3.0', 'วิชาชีววิทยาพื้นฐาน', 'ม.1', 3, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(26, 'อ20217', 'การอ่านเพื่อความเข้าใจ 1', '2.0', 'วิชาการอ่านเพื่อความเข้าใจ', 'ม.1', 8, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(27, 'ว20224', 'เสริมทักษะกระบวนการวิทยาศาสตร์ 2', '3.0', 'วิชาเสริมทักษะกระบวนการวิทยาศาสตร์ 2', 'ม.1', 3, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(28, 'ก20941', 'แนะแนว', '1.0', 'วิชาการแนะแนว', 'ม.1', 9, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(29, 'ก20951', 'ชุมนุม', '1.0', 'วิชาชุมนุม', 'ม.1', 9, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(30, 'ก20991', 'ลูกเสือ-เนตรนารี', '1.0', 'วิชาลูกเสือ-เนตรนารี', 'ม.1', 9, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(31, 'ก20981', 'เพื่อสังคมและสาธารณประโยชน์', '1.0', 'วิชาเพื่อสังคมและสาธารณประโยชน์', 'ม.1', 9, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(32, 'ก21901', 'กิจกรรมเสริมทักษะวิชาการ', '1.0', 'กิจกรรมเสริมทักษะวิชาการ', 'ม.1', 9, '2025-07-13 16:33:45', '2025-07-13 16:33:45'),
(33, 'ท22101', 'ภาษาไทย 2', '3.0', 'วิชาภาษาไทย 2', 'ม.2', 1, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(34, 'ค22101', 'คณิตศาสตร์ 2', '3.0', 'วิชาคณิตศาสตร์ 2', 'ม.2', 2, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(35, 'ว22101', 'วิทยาศาสตร์ 2', '3.0', 'วิชาวิทยาศาสตร์ 2', 'ม.2', 3, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(36, 'ส22101', 'สังคมศึกษา 1', '3.0', 'วิชาสังคมศึกษา 1', 'ม.2', 4, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(37, 'ส22102', 'สังคมศึกษา 2', '3.0', 'วิชาสังคมศึกษา 2', 'ม.2', 4, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(38, 'พ22101', 'พลศึกษา 2', '2.0', 'วิชาพลศึกษา 2', 'ม.2', 5, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(39, 'พ22103', 'พลศึกษา 3', '2.0', 'วิชาพลศึกษา 3', 'ม.2', 5, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(40, 'ศ22101', 'ศิลปะ 2', '2.0', 'วิชาศิลปะ 2', 'ม.2', 6, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(41, 'อ22101', 'ภาษาอังกฤษ 2', '3.0', 'วิชาภาษาอังกฤษ 2', 'ม.2', 8, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(42, 'ว22105', 'เทคโนโลยีและวิทยาการคำนวณ 2', '2.0', 'วิชาเทคโนโลยีและวิทยาการคำนวณ 2', 'ม.2', 3, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(43, 'ง20278', 'งานดอกไม้ประดิษฐ์', '2.0', 'วิชางานดอกไม้ประดิษฐ์', 'ม.2', 7, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(44, 'ง20209', 'งานปลูกผักปลอดสารพิษ', '2.0', 'วิชางานปลูกผักปลอดสารพิษ', 'ม.2', 7, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(45, 'ง20286', 'การเขียนแบบ 2', '2.0', 'วิชาการเขียนแบบ 2', 'ม.2', 7, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(46, 'ง22269', 'งานธุรกิจ 1', '2.0', 'วิชางานธุรกิจ 1', 'ม.2', 7, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(47, 'ศ20215', 'ศิลปะเพื่อการแสดง 3', '2.0', 'วิชาศิลปะเพื่อการแสดง 3', 'ม.2', 6, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(48, 'ส20287', 'แบกเป้ท่องไทย', '1.0', 'วิชาการท่องเที่ยวในประเทศ', 'ม.2', 4, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(49, 'ท20217', 'พัฒนาทักษะการอ่านและเขียน 3', '2.0', 'วิชาพัฒนาทักษะการอ่านและการเขียน 3', 'ม.2', 1, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(50, 'ก20203', 'ภาษาเกาหลี 3', '3.0', 'วิชาภาษาเกาหลี 3', 'ม.2', 8, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(51, 'จ20203', 'ภาษาจีน 3', '3.0', 'วิชาภาษาจีน 3', 'ม.2', 8, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(52, 'อ20207', 'ภาษาอังกฤษในชีวิตประจำวัน 1', '3.0', 'วิชาภาษาอังกฤษในชีวิตประจำวัน', 'ม.2', 8, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(53, 'ค20215', 'คณิตศาสตร์เสริมศักยภาพ 3', '3.0', 'วิชาคณิตศาสตร์เสริมศักยภาพ 3', 'ม.2', 2, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(54, 'ว20240', 'STEAM 1', '2.0', 'วิชา STEAM 1', 'ม.2', 3, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(55, 'ว20233', 'เคมีพื้นฐานและปฏิบัติการ 1', '3.0', 'วิชาเคมีพื้นฐานและปฏิบัติการ 1', 'ม.2', 3, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(56, 'ค20221', 'คณิตศาสตร์สำหรับวิทยาศาสตร์', '3.0', 'วิชาคณิตศาสตร์สำหรับวิทยาศาสตร์', 'ม.2', 2, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(57, 'ว20219', 'สะเต็มศึกษา 1', '2.0', 'วิชาสะเต็มศึกษา 1', 'ม.2', 3, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(58, 'I20201', 'การศึกษาค้นคว้าและสร้างองค์ความรู้', '2.0', 'วิชาการศึกษาค้นคว้าและสร้างองค์ความรู้', 'ม.2', 3, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(59, 'ก20943', 'แนะแนว', '1.0', 'วิชาการแนะแนว', 'ม.2', 9, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(60, 'ก20953', 'ชุมนุม', '1.0', 'วิชาชุมนุม', 'ม.2', 9, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(61, 'ก20993', 'ลูกเสือ-เนตรนารี', '1.0', 'วิชาลูกเสือ-เนตรนารี', 'ม.2', 9, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(62, 'ก20983', 'เพื่อสังคมและสาธารณประโยชน์', '1.0', 'วิชาเพื่อสังคมและสาธารณประโยชน์', 'ม.2', 9, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(63, 'ก22901', 'กิจกรรมเสริมทักษะวิชาการ', '1.0', 'กิจกรรมเสริมทักษะวิชาการ', 'ม.2', 9, '2025-07-13 16:55:15', '2025-07-13 16:55:15'),
(64, 'ท23101', 'ภาษาไทย 3', '3.0', 'วิชาภาษาไทย 3', 'ม.3', 1, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(65, 'ค23101', 'คณิตศาสตร์ 3', '3.0', 'วิชาคณิตศาสตร์ 3', 'ม.3', 2, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(66, 'ว23101', 'วิทยาศาสตร์ 3', '3.0', 'วิชาวิทยาศาสตร์ 3', 'ม.3', 3, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(67, 'ก20945', 'แนะแนว', '1.0', 'วิชาการแนะแนว', 'ม.3', 9, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(68, 'ก20955', 'ชุมนุม', '1.0', 'วิชาชุมนุม', 'ม.3', 9, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(69, 'ก20965', 'ลูกเสือ', '1.0', 'วิชาลูกเสือ', 'ม.3', 9, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(70, 'ก20975', 'ยุวกาชาด', '1.0', 'วิชายุวกาชาด', 'ม.3', 9, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(71, 'ก20985', 'เพื่อสังคมและสาธารณประโยชน์', '1.0', 'วิชาเพื่อสังคมและสาธารณประโยชน์', 'ม.3', 9, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(72, 'ก23901', 'กิจกรรมเสริมทักษะวิชาการ', '1.0', 'กิจกรรมเสริมทักษะวิชาการ', 'ม.3', 9, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(73, 'ส23101', 'สังคมศึกษา 3', '3.0', 'วิชาสังคมศึกษา 3', 'ม.3', 4, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(74, 'ส23102', 'สังคมศึกษา 4', '3.0', 'วิชาสังคมศึกษา 4', 'ม.3', 4, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(75, 'พ23101', 'พลศึกษา 4', '2.0', 'วิชาพลศึกษา 4', 'ม.3', 5, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(76, 'พ23103', 'พลศึกษา 5', '2.0', 'วิชาพลศึกษา 5', 'ม.3', 5, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(77, 'ศ23101', 'ศิลปะ 3', '2.0', 'วิชาศิลปะ 3', 'ม.3', 6, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(78, 'อ23101', 'ภาษาอังกฤษ 3', '3.0', 'วิชาภาษาอังกฤษ 3', 'ม.3', 8, '2025-07-14 05:15:16', '2025-07-14 05:15:16'),
(79, 'ง20293', 'ช่างร้อยมาลัย', '2.0', 'วิชาช่างร้อยมาลัย', 'ม.3', 7, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(80, 'ง23265', 'ไม้กระถางเพื่อการค้า 1', '2.0', 'วิชาไม้กระถางเพื่อการค้า 1', 'ม.3', 7, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(81, 'ง20281', 'ช่างปูน 1', '2.0', 'วิชาช่างปูน 1', 'ม.3', 7, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(82, 'พ20207', 'การปฐมพยาบาล', '1.0', 'วิชาการปฐมพยาบาล', 'ม.3', 5, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(83, 'ศ20219', 'ดนตรีเพื่อการแสดง 4', '2.0', 'วิชาดนตรีเพื่อการแสดง 4', 'ม.3', 6, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(84, 'ท20219', 'พัฒนาทักษะการอ่านและเขียน 5', '2.0', 'วิชาพัฒนาทักษะการอ่านและเขียน 5', 'ม.3', 8, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(85, 'อ20215', 'ภาษาอังกฤษเพื่อการศึกษาต่อ 1', '3.0', 'วิชาภาษาอังกฤษเพื่อการศึกษาต่อ 1', 'ม.3', 8, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(86, 'จ20205', 'ภาษาจีน 5', '3.0', 'วิชาภาษาจีน 5', 'ม.3', 8, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(87, 'จ20217', 'ภาษาจีนในชีวิตประจำวัน 1', '3.0', 'วิชาภาษาจีนในชีวิตประจำวัน 1', 'ม.3', 8, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(88, 'ค20217', 'คณิตศาสตร์เสริมศักยภาพ 5', '3.0', 'วิชาคณิตศาสตร์เสริมศักยภาพ 5', 'ม.3', 2, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(89, 'ว20205', 'เริ่มต้นกับโครงงานวิทยาศาสตร์', '2.0', 'วิชาเริ่มต้นกับโครงงานวิทยาศาสตร์', 'ม.3', 3, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(90, 'ว20228', 'วิทยาศาสตร์คำนวณ', '2.0', 'วิชาวิทยาศาสตร์คำนวณ', 'ม.3', 3, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(91, 'อ20211', 'ภาษาอังกฤษรอบรู้ 1', '3.0', 'วิชาภาษาอังกฤษรอบรู้ 1', 'ม.3', 8, '2025-07-14 05:26:45', '2025-07-14 05:26:45'),
(92, 'ส20288', 'การป้องกันทุจริต 1', '1.0', 'วิชาการป้องกันทุจริต 1', 'ม.3', 4, '2025-07-14 05:26:45', '2025-07-14 05:26:45');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`subject_id`),
  ADD UNIQUE KEY `subject_code` (`subject_code`),
  ADD KEY `area_id` (`area_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `subjects`
--
ALTER TABLE `subjects`
  MODIFY `subject_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `subjects`
--
ALTER TABLE `subjects`
  ADD CONSTRAINT `subjects_ibfk_1` FOREIGN KEY (`area_id`) REFERENCES `learning_areas` (`area_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
